{"class_name": "Sequential", "config": [{"class_name": "Flatten", "config": {"batch_input_shape": [null, 14, 64], "trainable": true, "name": "flatten_14", "input_dtype": "float32"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_37", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "output_dim": 40}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_37"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_38", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "output_dim": 10}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_38"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_39", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "output_dim": 1}}, {"class_name": "Activation", "config": {"activation": "sigmoid", "trainable": true, "name": "activation_39"}}]}